https://www.youtube.com/watch?v=-QeOyTk78Vc&list=PLeqyOOqxeiIOBthdddnMnusyrbOOade8-&index=1&t=4s
https://github.com/okovtun/BV_011
http://cplusplus.com/doc/tutorial/

TODO:
1. ВЫУЧИТЬ ВСЮ ТЕОРИЮ: типы данных, операторы !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
2. Написать программу, которая по температуре воздуха определяет, на улице тепло, или холодно. Температуру воздуха, пользователь вводит с клавиатуры;
3. Пользователь вводит число с клавиатуры. Если это число лежит в промежутке от 0 до 10, то программа говорит: "Цель поражена", в противном случае - "Вы промахнулись (Firefox)".
4. Написать программу для тестирования, которая задает ползователю 5 вопросов, по 4 варианта ответов на каждый,  варианты ответов обозначены буквами ABCD. Пользователь вводит букву, соответсвующую правильному на его взгляд варианту, после чего, программа говорит ответ правильный, или нет. В конце, программа выводит количество правильных ответов.

DONE:
----------------------------- 1 --------------------------------
int i = 3;
i = ++i + ++i;
cout << i << endl;

----------------------------- 2 --------------------------------

int i = 3;
i = i++ + ++i;
cout << i << endl;

----------------------------- 3 --------------------------------

int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

----------------------------- 4 --------------------------------

int i = 3;
i = i++ + 1 + ++i *= 2;
cout << i << endl;

----------------------------- 5 --------------------------------

int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;

=======================================================================

DONE:
Решить задачи из файла VariablesTask.pdf

TOREAD:
http://cplusplus.com/doc/tutorial/constants/

TODO:
1. Используя вывод на экран и Escape-последовательности вывести в окно консоли стишок "В лесу родилась Ёлочка". Стишок должен быть выровнен по середине окна косоли и его куплеты должны быть разделены пустой строкой.
2. ВЫУЧИТЬ ТЕОРИЮ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!