https://www.youtube.com/watch?v=-QeOyTk78Vc&list=PLeqyOOqxeiIOBthdddnMnusyrbOOade8-&index=1&t=4s
https://github.com/okovtun/BV_011
http://cplusplus.com/doc/tutorial/
http://cplusplus.com/doc/tutorial/control/

TODO:

+ - + - +
- + - + -
+ - + - +
- + - + -
+ - + - +

1. Добить Геометрию;
2. Добить старые домашки на ВЛОЖЕННЫЕ FOR-ы;
3. У кого все это сделано, ChessBoard.jpg здесь: https://github.com/okovtun/BV_011/tree/master/ControlStructures/Geometria/Task ;-)
4. Ну если совсем уже будет скучно, то открываем HardChess.jpg (Don't hate me please:))

DONE:
1. Вывести на экран таблицу Пифагора;
2. Вывести на экран ряд простых чисел до введенного с клавиатуры. Простым называется число, которе делится только на себя и на единицу;
3. Вывести на экран фигуры из файла Geometria1.txt;

DONE:
1. Используя цикл for, написать программу, которая вычисляет факториал числа, введенного с клавиатуры

			5! = 1*2*3*4*5 = 120;

2. Используя цикл for возвести указанное число, в указанную степень. Оснвание и показатель степени вводятся с клавиатуры;

3. Используя цикл for, вывести на экран таблицу ASCII символов, разделенных пробелами, по 16 символов в строке;

======================================================================================================

DONE:
1. Пользователь вводит число с клавиатуры, и приграмма должна сказать, является это число палиндромом, или нет;
12321
1221
5

2. Пользователь вводит номер автобусного билета, программа должна сказать, счастливый он, или нет.

1*2*3*4*5

DONE:
Добить калькулятор!

DONE:
1. ВЫУЧИТЬ ВСЮ ТЕОРИЮ: типы данных, операторы !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
2. Написать программу, которая по температуре воздуха определяет, на улице тепло, или холодно. Температуру воздуха, пользователь вводит с клавиатуры;
3. Пользователь вводит число с клавиатуры. Если это число лежит в промежутке от 0 до 10, то программа говорит: "Цель поражена", в противном случае - "Вы промахнулись (Firefox)".
4. Написать программу для тестирования, которая задает ползователю 5 вопросов, по 4 варианта ответов на каждый,  варианты ответов обозначены буквами ABCD. Пользователь вводит букву, соответсвующую правильному на его взгляд варианту, после чего, программа говорит ответ правильный, или нет. В конце, программа выводит количество правильных ответов.

DONE:
----------------------------- 1 --------------------------------
int i = 3;
i = ++i + ++i;
cout << i << endl;

----------------------------- 2 --------------------------------

int i = 3;
i = i++ + ++i;
cout << i << endl;

----------------------------- 3 --------------------------------

int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

----------------------------- 4 --------------------------------

int i = 3;
i = i++ + 1 + ++i *= 2;
cout << i << endl;

----------------------------- 5 --------------------------------

int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;

=======================================================================

DONE:
Решить задачи из файла VariablesTask.pdf

TOREAD:
http://cplusplus.com/doc/tutorial/constants/

TODO:
1. Используя вывод на экран и Escape-последовательности вывести в окно консоли стишок "В лесу родилась Ёлочка". Стишок должен быть выровнен по середине окна косоли и его куплеты должны быть разделены пустой строкой.
2. ВЫУЧИТЬ ТЕОРИЮ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!